----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 30, 30]           1,792
       BatchNorm2d-2           [-1, 64, 30, 30]             128
              ReLU-3           [-1, 64, 30, 30]               0
            Conv2d-4           [-1, 64, 30, 30]           4,096
       BatchNorm2d-5           [-1, 64, 30, 30]             128
              ReLU-6           [-1, 64, 30, 30]               0
            Conv2d-7           [-1, 64, 30, 30]          36,864
       BatchNorm2d-8           [-1, 64, 30, 30]             128
              ReLU-9           [-1, 64, 30, 30]               0
           Conv2d-10          [-1, 256, 30, 30]          16,384
      BatchNorm2d-11          [-1, 256, 30, 30]             512
           Conv2d-12          [-1, 256, 30, 30]          16,384
      BatchNorm2d-13          [-1, 256, 30, 30]             512
             ReLU-14          [-1, 256, 30, 30]               0
       Bottleneck-15          [-1, 256, 30, 30]               0
           Conv2d-16           [-1, 64, 30, 30]          16,384
      BatchNorm2d-17           [-1, 64, 30, 30]             128
             ReLU-18           [-1, 64, 30, 30]               0
           Conv2d-19           [-1, 64, 30, 30]          36,864
      BatchNorm2d-20           [-1, 64, 30, 30]             128
             ReLU-21           [-1, 64, 30, 30]               0
           Conv2d-22          [-1, 256, 30, 30]          16,384
      BatchNorm2d-23          [-1, 256, 30, 30]             512
             ReLU-24          [-1, 256, 30, 30]               0
       Bottleneck-25          [-1, 256, 30, 30]               0
           Conv2d-26           [-1, 64, 30, 30]          16,384
      BatchNorm2d-27           [-1, 64, 30, 30]             128
             ReLU-28           [-1, 64, 30, 30]               0
           Conv2d-29           [-1, 64, 30, 30]          36,864
      BatchNorm2d-30           [-1, 64, 30, 30]             128
             ReLU-31           [-1, 64, 30, 30]               0
           Conv2d-32          [-1, 256, 30, 30]          16,384
      BatchNorm2d-33          [-1, 256, 30, 30]             512
             ReLU-34          [-1, 256, 30, 30]               0
       Bottleneck-35          [-1, 256, 30, 30]               0
           Conv2d-36          [-1, 128, 30, 30]          32,768
      BatchNorm2d-37          [-1, 128, 30, 30]             256
             ReLU-38          [-1, 128, 30, 30]               0
           Conv2d-39          [-1, 128, 15, 15]         147,456
      BatchNorm2d-40          [-1, 128, 15, 15]             256
             ReLU-41          [-1, 128, 15, 15]               0
           Conv2d-42          [-1, 512, 15, 15]          65,536
      BatchNorm2d-43          [-1, 512, 15, 15]           1,024
           Conv2d-44          [-1, 512, 15, 15]         131,072
      BatchNorm2d-45          [-1, 512, 15, 15]           1,024
             ReLU-46          [-1, 512, 15, 15]               0
       Bottleneck-47          [-1, 512, 15, 15]               0
           Conv2d-48          [-1, 128, 15, 15]          65,536
      BatchNorm2d-49          [-1, 128, 15, 15]             256
             ReLU-50          [-1, 128, 15, 15]               0
           Conv2d-51          [-1, 128, 15, 15]         147,456
      BatchNorm2d-52          [-1, 128, 15, 15]             256
             ReLU-53          [-1, 128, 15, 15]               0
           Conv2d-54          [-1, 512, 15, 15]          65,536
      BatchNorm2d-55          [-1, 512, 15, 15]           1,024
             ReLU-56          [-1, 512, 15, 15]               0
       Bottleneck-57          [-1, 512, 15, 15]               0
           Conv2d-58          [-1, 128, 15, 15]          65,536
      BatchNorm2d-59          [-1, 128, 15, 15]             256
             ReLU-60          [-1, 128, 15, 15]               0
           Conv2d-61          [-1, 128, 15, 15]         147,456
      BatchNorm2d-62          [-1, 128, 15, 15]             256
             ReLU-63          [-1, 128, 15, 15]               0
           Conv2d-64          [-1, 512, 15, 15]          65,536
      BatchNorm2d-65          [-1, 512, 15, 15]           1,024
             ReLU-66          [-1, 512, 15, 15]               0
       Bottleneck-67          [-1, 512, 15, 15]               0
           Conv2d-68          [-1, 128, 15, 15]          65,536
      BatchNorm2d-69          [-1, 128, 15, 15]             256
             ReLU-70          [-1, 128, 15, 15]               0
           Conv2d-71          [-1, 128, 15, 15]         147,456
      BatchNorm2d-72          [-1, 128, 15, 15]             256
             ReLU-73          [-1, 128, 15, 15]               0
           Conv2d-74          [-1, 512, 15, 15]          65,536
      BatchNorm2d-75          [-1, 512, 15, 15]           1,024
             ReLU-76          [-1, 512, 15, 15]               0
       Bottleneck-77          [-1, 512, 15, 15]               0
           Conv2d-78          [-1, 256, 15, 15]         131,072
      BatchNorm2d-79          [-1, 256, 15, 15]             512
             ReLU-80          [-1, 256, 15, 15]               0
           Conv2d-81            [-1, 256, 8, 8]         589,824
      BatchNorm2d-82            [-1, 256, 8, 8]             512
             ReLU-83            [-1, 256, 8, 8]               0
           Conv2d-84           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-85           [-1, 1024, 8, 8]           2,048
           Conv2d-86           [-1, 1024, 8, 8]         524,288
      BatchNorm2d-87           [-1, 1024, 8, 8]           2,048
             ReLU-88           [-1, 1024, 8, 8]               0
       Bottleneck-89           [-1, 1024, 8, 8]               0
           Conv2d-90            [-1, 256, 8, 8]         262,144
      BatchNorm2d-91            [-1, 256, 8, 8]             512
             ReLU-92            [-1, 256, 8, 8]               0
           Conv2d-93            [-1, 256, 8, 8]         589,824
      BatchNorm2d-94            [-1, 256, 8, 8]             512
             ReLU-95            [-1, 256, 8, 8]               0
           Conv2d-96           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-97           [-1, 1024, 8, 8]           2,048
             ReLU-98           [-1, 1024, 8, 8]               0
       Bottleneck-99           [-1, 1024, 8, 8]               0
          Conv2d-100            [-1, 256, 8, 8]         262,144
     BatchNorm2d-101            [-1, 256, 8, 8]             512
            ReLU-102            [-1, 256, 8, 8]               0
          Conv2d-103            [-1, 256, 8, 8]         589,824
     BatchNorm2d-104            [-1, 256, 8, 8]             512
            ReLU-105            [-1, 256, 8, 8]               0
          Conv2d-106           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-107           [-1, 1024, 8, 8]           2,048
            ReLU-108           [-1, 1024, 8, 8]               0
      Bottleneck-109           [-1, 1024, 8, 8]               0
          Conv2d-110            [-1, 256, 8, 8]         262,144
     BatchNorm2d-111            [-1, 256, 8, 8]             512
            ReLU-112            [-1, 256, 8, 8]               0
          Conv2d-113            [-1, 256, 8, 8]         589,824
     BatchNorm2d-114            [-1, 256, 8, 8]             512
            ReLU-115            [-1, 256, 8, 8]               0
          Conv2d-116           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-117           [-1, 1024, 8, 8]           2,048
            ReLU-118           [-1, 1024, 8, 8]               0
      Bottleneck-119           [-1, 1024, 8, 8]               0
          Conv2d-120            [-1, 256, 8, 8]         262,144
     BatchNorm2d-121            [-1, 256, 8, 8]             512
            ReLU-122            [-1, 256, 8, 8]               0
          Conv2d-123            [-1, 256, 8, 8]         589,824
     BatchNorm2d-124            [-1, 256, 8, 8]             512
            ReLU-125            [-1, 256, 8, 8]               0
          Conv2d-126           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-127           [-1, 1024, 8, 8]           2,048
            ReLU-128           [-1, 1024, 8, 8]               0
      Bottleneck-129           [-1, 1024, 8, 8]               0
          Conv2d-130            [-1, 256, 8, 8]         262,144
     BatchNorm2d-131            [-1, 256, 8, 8]             512
            ReLU-132            [-1, 256, 8, 8]               0
          Conv2d-133            [-1, 256, 8, 8]         589,824
     BatchNorm2d-134            [-1, 256, 8, 8]             512
            ReLU-135            [-1, 256, 8, 8]               0
          Conv2d-136           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-137           [-1, 1024, 8, 8]           2,048
            ReLU-138           [-1, 1024, 8, 8]               0
      Bottleneck-139           [-1, 1024, 8, 8]               0
          Conv2d-140            [-1, 512, 8, 8]         524,288
     BatchNorm2d-141            [-1, 512, 8, 8]           1,024
            ReLU-142            [-1, 512, 8, 8]               0
          Conv2d-143            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-144            [-1, 512, 4, 4]           1,024
            ReLU-145            [-1, 512, 4, 4]               0
          Conv2d-146           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-147           [-1, 2048, 4, 4]           4,096
          Conv2d-148           [-1, 2048, 4, 4]       2,097,152
     BatchNorm2d-149           [-1, 2048, 4, 4]           4,096
            ReLU-150           [-1, 2048, 4, 4]               0
      Bottleneck-151           [-1, 2048, 4, 4]               0
          Conv2d-152            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-153            [-1, 512, 4, 4]           1,024
            ReLU-154            [-1, 512, 4, 4]               0
          Conv2d-155            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-156            [-1, 512, 4, 4]           1,024
            ReLU-157            [-1, 512, 4, 4]               0
          Conv2d-158           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-159           [-1, 2048, 4, 4]           4,096
            ReLU-160           [-1, 2048, 4, 4]               0
      Bottleneck-161           [-1, 2048, 4, 4]               0
          Conv2d-162            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-163            [-1, 512, 4, 4]           1,024
            ReLU-164            [-1, 512, 4, 4]               0
          Conv2d-165            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-166            [-1, 512, 4, 4]           1,024
            ReLU-167            [-1, 512, 4, 4]               0
          Conv2d-168           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-169           [-1, 2048, 4, 4]           4,096
            ReLU-170           [-1, 2048, 4, 4]               0
      Bottleneck-171           [-1, 2048, 4, 4]               0
AdaptiveAvgPool2d-172           [-1, 2048, 1, 1]               0
================================================================
Total params: 23,500,416
Trainable params: 23,500,416
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 80.56
Params size (MB): 89.65
Estimated Total Size (MB): 170.21
----------------------------------------------------------------
